Revit 2025 API
ConditionType Enumeration
An enumerated type listing all the possible condition types for a space object.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum ConditionType
Public Enumeration ConditionType
public enum class ConditionType
type ConditionType
Members
Member name | Value | Description
Heated | 0 | Condition Type is Heated.
Cooled | 1 | Condition Type is Cooled.
HeatedAndCooled | 2 | Condition Type is HeatedAndCooled.
Unconditioned | 3 | Condition Type is Unconditioned.
Vented | 4 | Condition Type is Vented.
NaturallyVentedOnly | 5 | Condition Type is NaturallyVentedOnly.
NoOfConditionTypes | 6 | Condition Type is NoOfConditionTypes.
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace